Revit 2026 API

# IOpenFromCloudCallback Interface

---

An interface that may be used to control Revit's behavior when opening a cloud model.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IOpenFromCloudCallback
```
```vb
Public Interface IOpenFromCloudCallback
```
```cpp
public interface class IOpenFromCloudCallback
```
```fsharp
type IOpenFromCloudCallback = interface end
```

The IOpenFromCloudCallback type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnOpenConflict | A method called when the conflict is happen during the model opening. |

#### Reference

Autodesk.Revit.DB Namespace